In [1]:
import numpy as np

In [2]:
import pandas as pd

# **** Series ****

what differentiates the numpy array from a pandas series is that a series do have axis labels meaning it can be indexed by a label.

#### Series vs Numpy Array

In [3]:
val = [100,200,300] # created a list

In [4]:
val_ser = pd.Series(data = val)

val_ser

0    100
1    200
2    300
dtype: int64

In [5]:
val_ser[1]

200

Now I can specify my index in series, which is not possible in numpy array.
<p>You can change the index

In [6]:
my_label = ['x','y','z']

In [7]:
val_ser1 = pd.Series(data = val, index = my_label)

val_ser1

x    100
y    200
z    300
dtype: int64

you can pass numpy array in a series

In [8]:
arr1=np.array(val)

arr1

array([100, 200, 300])

In [9]:
val_ser2 = pd.Series(data = arr1)

val_ser2

0    100
1    200
2    300
dtype: int64

#### Series vs Dictionary

In [10]:
dict = {'x':23,'y':34, 'z':77}

In [11]:
val_ser3 = pd.Series(data = dict) #key is assigned as an index number

val_ser3

x    23
y    34
z    77
dtype: int64

### Some other way to creating series

In [12]:
new_ser = pd.Series([33,44,55,66],['p','q','r','s'])

new_ser

p    33
q    44
r    55
s    66
dtype: int64

# **** DataFrames ****

In [13]:
from numpy.random import rand

In [14]:
df = pd.DataFrame(rand(6,5))

In [15]:
df

          0         1         2         3         4
0  0.990314  0.652045  0.477521  0.516885  0.555045
1  0.794730  0.336344  0.182765  0.254636  0.167182
2  0.313704  0.069053  0.847559  0.950708  0.483461
3  0.136208  0.588437  0.076483  0.321342  0.067818
4  0.732901  0.668752  0.372688  0.323636  0.213539
5  0.160490  0.656186  0.067747  0.805164  0.209061

In [16]:
#creating a dataframe with assigned labels

df = pd.DataFrame(rand(6,5),['L','M','N','O','P','Q'], ['A','B','C','D','E'])

df

          A         B         C         D         E
L  0.480328  0.746819  0.008750  0.962353  0.750057
M  0.055304  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160
P  0.035178  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118  0.123143  0.659726  0.893599

#### Each of these coloumns and rows are pandas series that sharing the same index

### Selecting coloumns

In [17]:
df['A']

L    0.480328
M    0.055304
N    0.737158
O    0.941004
P    0.035178
Q    0.465565
Name: A, dtype: float64

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
type(df['A'])

pandas.core.series.Series

In [20]:
#displaying multiple coloumns

df[['B','C']]

          B         C
L  0.746819  0.008750
M  0.529850  0.333361
N  0.636782  0.858335
O  0.113593  0.222881
P  0.881748  0.341881
Q  0.841118  0.123143

##### when we are calling single coloumn then its a series and for multiple coloumn its a Data Frame

### Selecting Rows

In [21]:
df

          A         B         C         D         E
L  0.480328  0.746819  0.008750  0.962353  0.750057
M  0.055304  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160
P  0.035178  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118  0.123143  0.659726  0.893599

In [22]:
df.loc['P'] #Its a series

A    0.035178
B    0.881748
C    0.341881
D    0.632840
E    0.466332
Name: P, dtype: float64

In [23]:
#selecting any rows with its index number

df.iloc[4]

A    0.035178
B    0.881748
C    0.341881
D    0.632840
E    0.466332
Name: P, dtype: float64

In [24]:
df.loc['N','C'] #selecting with labels

#df.iloc[2,2] #Selecting with index no

0.8583354226040538

In [25]:
df.loc[['M','N'],['C','D']]

#df.iloc[[1,2],[2,3]]

          C         D
M  0.333361  0.442225
N  0.858335  0.265443

## Adding and dropping a coloumn

In [26]:
df['col'] = df['B'] + df['C']

In [27]:
df

          A         B         C         D         E       col
L  0.480328  0.746819  0.008750  0.962353  0.750057  0.755570
M  0.055304  0.529850  0.333361  0.442225  0.699968  0.863210
N  0.737158  0.636782  0.858335  0.265443  0.249909  1.495118
O  0.941004  0.113593  0.222881  0.166813  0.607160  0.336475
P  0.035178  0.881748  0.341881  0.632840  0.466332  1.223628
Q  0.465565  0.841118  0.123143  0.659726  0.893599  0.964261

#### Dropping a coloumn

In [28]:
df.drop('col',axis = 1) # axis = 1 is for coloumn
                        # axis = 0 is for row (It's by default)

          A         B         C         D         E
L  0.480328  0.746819  0.008750  0.962353  0.750057
M  0.055304  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160
P  0.035178  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118  0.123143  0.659726  0.893599

In [29]:
df # still we can find the deleted coloumn'col'

          A         B         C         D         E       col
L  0.480328  0.746819  0.008750  0.962353  0.750057  0.755570
M  0.055304  0.529850  0.333361  0.442225  0.699968  0.863210
N  0.737158  0.636782  0.858335  0.265443  0.249909  1.495118
O  0.941004  0.113593  0.222881  0.166813  0.607160  0.336475
P  0.035178  0.881748  0.341881  0.632840  0.466332  1.223628
Q  0.465565  0.841118  0.123143  0.659726  0.893599  0.964261

In [30]:
df.drop('col',axis = 1,inplace = True) # coloumn name 'col' deleted permanently

In [31]:
df

          A         B         C         D         E
L  0.480328  0.746819  0.008750  0.962353  0.750057
M  0.055304  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160
P  0.035178  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118  0.123143  0.659726  0.893599

#### Dropping a row

In [32]:
df.drop('Q', axis = 0) # row no 'Q' is dropped

          A         B         C         D         E
L  0.480328  0.746819  0.008750  0.962353  0.750057
M  0.055304  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160
P  0.035178  0.881748  0.341881  0.632840  0.466332

## Conditional Selection and Checking

In [33]:
df

          A         B         C         D         E
L  0.480328  0.746819  0.008750  0.962353  0.750057
M  0.055304  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160
P  0.035178  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118  0.123143  0.659726  0.893599

In [34]:
df > 0.3

       A      B      C      D      E
L   True   True  False   True   True
M  False   True   True   True   True
N   True   True   True  False  False
O   True  False  False  False   True
P  False   True   True   True   True
Q   True   True  False   True   True

In [35]:
df[df > 0.3] #conditional checking with data frames

          A         B         C         D         E
L  0.480328  0.746819       NaN  0.962353  0.750057
M       NaN  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335       NaN       NaN
O  0.941004       NaN       NaN       NaN  0.607160
P       NaN  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118       NaN  0.659726  0.893599

In [36]:
df['A']

L    0.480328
M    0.055304
N    0.737158
O    0.941004
P    0.035178
Q    0.465565
Name: A, dtype: float64

In [37]:
df['A'] > .5

L    False
M    False
N     True
O     True
P    False
Q    False
Name: A, dtype: bool

In [38]:
df[df['A'] > .5]

          A         B         C         D         E
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160

In [39]:
df[df['A'] > .5]['D']

N    0.265443
O    0.166813
Name: D, dtype: float64

In [40]:
df[df['A'] > .5][['D','E']]

          D         E
N  0.265443  0.249909
O  0.166813  0.607160

In [41]:
condtn1 = df['A'] > .5
val = df[condtn1]
val[['D','E']]

          D         E
N  0.265443  0.249909
O  0.166813  0.607160

#### Multiple Condition checking

In [42]:
df

          A         B         C         D         E
L  0.480328  0.746819  0.008750  0.962353  0.750057
M  0.055304  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160
P  0.035178  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118  0.123143  0.659726  0.893599

In [43]:
df[df['A'] > .5]

          A         B         C         D         E
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160

In [44]:
df[(df['A'] > .5) and (df['E'] < .3)] #and operator used only for single True and False checking

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [45]:
True and False

False

In [46]:
df[(df['A'] > .5) & (df['E'] < .3)]

          A         B         C         D         E
N  0.737158  0.636782  0.858335  0.265443  0.249909

In [47]:
df[(df['A'] > .5) | (df['E'] < .3)]

          A         B         C         D         E
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160

## Reseting any Index in data frame

In [48]:
df

          A         B         C         D         E
L  0.480328  0.746819  0.008750  0.962353  0.750057
M  0.055304  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160
P  0.035178  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118  0.123143  0.659726  0.893599

In [49]:
df.reset_index()

  index         A         B         C         D         E
0     L  0.480328  0.746819  0.008750  0.962353  0.750057
1     M  0.055304  0.529850  0.333361  0.442225  0.699968
2     N  0.737158  0.636782  0.858335  0.265443  0.249909
3     O  0.941004  0.113593  0.222881  0.166813  0.607160
4     P  0.035178  0.881748  0.341881  0.632840  0.466332
5     Q  0.465565  0.841118  0.123143  0.659726  0.893599

## Seting any coloumn as an index

In [50]:
new_df = df.reset_index()

In [51]:
new_df

  index         A         B         C         D         E
0     L  0.480328  0.746819  0.008750  0.962353  0.750057
1     M  0.055304  0.529850  0.333361  0.442225  0.699968
2     N  0.737158  0.636782  0.858335  0.265443  0.249909
3     O  0.941004  0.113593  0.222881  0.166813  0.607160
4     P  0.035178  0.881748  0.341881  0.632840  0.466332
5     Q  0.465565  0.841118  0.123143  0.659726  0.893599

In [52]:
new_df1 = new_df.set_index('index')

In [53]:
new_df1

              A         B         C         D         E
index
L      0.480328  0.746819  0.008750  0.962353  0.750057
M      0.055304  0.529850  0.333361  0.442225  0.699968
N      0.737158  0.636782  0.858335  0.265443  0.249909
O      0.941004  0.113593  0.222881  0.166813  0.607160
P      0.035178  0.881748  0.341881  0.632840  0.466332
Q      0.465565  0.841118  0.123143  0.659726  0.893599

# Data Preprocessing (Missing Values)

In [54]:
df

          A         B         C         D         E
L  0.480328  0.746819  0.008750  0.962353  0.750057
M  0.055304  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335  0.265443  0.249909
O  0.941004  0.113593  0.222881  0.166813  0.607160
P  0.035178  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118  0.123143  0.659726  0.893599

In [55]:
pre_df = df[df > 0.3]

In [56]:
pre_df

          A         B         C         D         E
L  0.480328  0.746819       NaN  0.962353  0.750057
M       NaN  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335       NaN       NaN
O  0.941004       NaN       NaN       NaN  0.607160
P       NaN  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118       NaN  0.659726  0.893599

In [57]:
pre_df.dropna()# dropping any coloumn axis = 1

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [58]:
pre_df.dropna(thresh = 3) # less than 3 NaN values

          A         B         C         D         E
L  0.480328  0.746819       NaN  0.962353  0.750057
M       NaN  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335       NaN       NaN
P       NaN  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118       NaN  0.659726  0.893599

In [59]:
pre_df['E']

L    0.750057
M    0.699968
N         NaN
O    0.607160
P    0.466332
Q    0.893599
Name: E, dtype: float64

In [60]:
pre_df['E'].fillna(value = pre_df['E'].mean())

L    0.750057
M    0.699968
N    0.683423
O    0.607160
P    0.466332
Q    0.893599
Name: E, dtype: float64

In [61]:
pre_df

          A         B         C         D         E
L  0.480328  0.746819       NaN  0.962353  0.750057
M       NaN  0.529850  0.333361  0.442225  0.699968
N  0.737158  0.636782  0.858335       NaN       NaN
O  0.941004       NaN       NaN       NaN  0.607160
P       NaN  0.881748  0.341881  0.632840  0.466332
Q  0.465565  0.841118       NaN  0.659726  0.893599

In [62]:
pre_df.isnull()

       A      B      C      D      E
L  False  False   True  False  False
M   True  False  False  False  False
N  False  False  False   True   True
O  False   True   True   True  False
P   True  False  False  False  False
Q  False  False   True  False  False

In [63]:
pre_df.isnull().sum()

A    2
B    1
C    3
D    2
E    1
dtype: int64

# Group BY

In [64]:
data = {'Name':['Jai', 'AKS', 'Jai', 'Priya',  
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],   
        'Address':['Delhi', 'Kanpur', 'Pune', 'Nagpur', 
                   'Jaunpur', 'Kanpur', 'Pune', 'Bangalore'],  
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', 
                         'B.Tech', 'B.com', 'Msc', 'M.Tech'],
        'Salary':[20000,23000,54000,45000,32000,12000,28000,300000]}

In [65]:
df_gr = pd.DataFrame(data)

In [66]:
df_gr

     Name    Address Qualification  Salary
0     Jai      Delhi           Msc   20000
1     AKS     Kanpur            MA   23000
2     Jai       Pune           MCA   54000
3   Priya     Nagpur           Phd   45000
4  Gaurav    Jaunpur        B.Tech   32000
5    Anuj     Kanpur         B.com   12000
6  Princi       Pune           Msc   28000
7    Abhi  Bangalore        M.Tech  300000

In [67]:
gr_add = df_gr.groupby('Address')

In [68]:
gr_add.mean()

           Salary
Address
Bangalore  300000
Delhi       20000
Jaunpur     32000
Kanpur      17500
Nagpur      45000
Pune        41000

In [69]:
gr_add.sum()

           Salary
Address
Bangalore  300000
Delhi       20000
Jaunpur     32000
Kanpur      35000
Nagpur      45000
Pune        82000

In [70]:
gr_add.max()

             Name Qualification  Salary
Address
Bangalore    Abhi        M.Tech  300000
Delhi         Jai           Msc   20000
Jaunpur    Gaurav        B.Tech   32000
Kanpur       Anuj            MA   23000
Nagpur      Priya           Phd   45000
Pune       Princi           Msc   54000

In [71]:
gr_add.describe()

          Salary                                                        \
           count      mean           std       min       25%       50%
Address
Bangalore    1.0  300000.0           NaN  300000.0  300000.0  300000.0
Delhi        1.0   20000.0           NaN   20000.0   20000.0   20000.0
Jaunpur      1.0   32000.0           NaN   32000.0   32000.0   32000.0
Kanpur       2.0   17500.0   7778.174593   12000.0   14750.0   17500.0
Nagpur       1.0   45000.0           NaN   45000.0   45000.0   45000.0
Pune         2.0   41000.0  18384.776311   28000.0   34500.0   41000.0


                75%       max
Address
Bangalore  300000.0  300000.0
Delhi       20000.0   20000.0
Jaunpur     32000.0   32000.0
Kanpur      20250.0   23000.0
Nagpur      45000.0   45000.0
Pune        47500.0   54000.0

# THANK YOU